---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition
source: html/3af4a34d-fb1b-b3c6-dba3-f6a8e72460a6.htm
---
# ElectricalDemandFactorDefinition Methods

Adds a value to the value set for this demand factor definition